app/views/venues/index.html.erb

		<td>
		  <%= link_to venue.style.size, venue_styles_path(venue) %>
---
SELECT `styles`.* FROM `styles` WHERE (`styles`.venue_id = 1)

    <td>
      <%= venue.date__venue.strftime("%Y-%m-%d") if venue.date__venue.present? %>
---
SELECT `venues`.* FROM `venues`

		<td>
		  <%= link_to venue.meeting_room.size, venue_meeting_rooms_path(venue) %>
---
SELECT `meeting_rooms`.* FROM `meeting_rooms` WHERE (`meeting_rooms`.venue_id = 1)